{
  "user": {
    "image": "http://localhost:4000/filebucket/user.jpg",
    "location": "New York City"
  },
  "pets": [
    {
      "id": 1,
      "category": "dog",
      "image": "http://localhost:4000/filebucket/dog1.png",
      "breed": "Greyhound",
      "gender": "male",
      "location": "New York City",
      "short_description": "A sleek, gentle and fast sighthound built for speed.",
      "long_description": "This Greyhound is a calm, elegant soul who loves quiet companionship. Though built for speed, they’re happiest relaxing by your side. Gentle, sensitive, and deeply loyal, they’re looking for a peaceful home where they can bond closely with their people. They’ll thrive with someone who appreciates a soft-hearted, easygoing friend."
    },
    {
      "id": 2,
      "category": "dog",
      "image": "http://localhost:4000/filebucket/dog2.png",
      "breed": "Dobermann",
      "gender": "male",
      "location": "Atlanta",
      "short_description": "Alert, loyal guardian with sleek, powerful build.",
      "long_description": "This Dobermann is a loyal, intelligent companion who forms strong connections with their family. Alert and protective, they thrive with clear structure and guidance. Beneath the powerful exterior is a sensitive dog seeking a home with stability, affection, and purpose. With the right person, they blossom into a confident and devoted partner."
    },
    {
      "id": 3,
      "category": "dog",
      "image": "http://localhost:4000/filebucket/dog3.png",
      "breed": "Pomeranian",
      "gender": "female",
      "location": "Philadelphia",
      "short_description": "Tiny, fluffy companion with bold, lively spirit.",
      "long_description": "This Pomeranian may be tiny, but their personality is anything but. Lively, curious, and expressive, they adore being near their humans. They’re looking for a home where their cheerful energy, charm, and big heart can shine — and where attention is plentiful. In return, they offer endless affection and a joyful presence."
    },
    {
      "id": 4,
      "category": "dog",
      "image": "http://localhost:4000/filebucket/dog4.png",
      "breed": "German Shepherd",
      "gender": "female",
      "location": "Philadelphia",
      "short_description": "Intelligent, loyal working dog with strength and agility.",
      "long_description": "This German Shepherd is a smart, loyal, and hardworking dog who loves learning and staying engaged. They’re searching for a home that offers mental stimulation, meaningful tasks, and close interaction. A devoted companion who gives back every bit of love they receive. With guidance and activity, they’ll quickly become an irreplaceable member of the family."
    },
    {
      "id": 5,
      "category": "dog",
      "image": "http://localhost:4000/filebucket/dog5.png",
      "breed": "Mastiff",
      "gender": "male",
      "location": "Los Angeles",
      "short_description": "Massive, gentle giant known for calm and devoted nature.",
      "long_description": "This Mastiff is a gentle giant with a warm, steady nature. Patient, affectionate, and incredibly loyal, they seek a home that appreciates calm companionship. With room for their big body and even bigger heart, they’ll offer unwavering devotion in return. Their soothing presence brings comfort to everyone around them."
    },
    {
      "id": 6,
      "category": "dog",
      "image": "http://localhost:4000/filebucket/dog6.png",
      "breed": "Chow Chow",
      "gender": "male",
      "location": "Chicago",
      "short_description": "Independent, fluffy dog with lion-like look and dignity.",
      "long_description": "This Chow Chow is a dignified, independent dog who bonds deeply with those they trust. They thrive in a peaceful home with routine and mutual respect. Once their trust is earned, they reveal a quiet but profound devotion to their people. They’ll be happiest with someone who values their thoughtful, reserved nature."
    },
    {
      "category": "dog",
      "image": "http://localhost:5000/filebucket/1763988203875-testdog.png",
      "breed": "Golden retriever",
      "gender": "Female",
      "location": "new york",
      "short_description": "Friendly, loyal, and intelligent dog with a golden coat, who loves people and is easy to train.",
      "long_description": "Golden Retrievers are happy, friendly, and intelligent dogs that thrive in families and love spending time with people and children. They are easy to train, social, and loyal, with a natural working drive that makes them excellent for hunting, retrieving, and as service dogs. Their golden coat and calm temperament make them beloved companion animals.",
      "id": 7
    },
    {
      "category": "dog",
      "image": "/testdog.png",
      "breed": "Golden retreiver",
      "gender": "male",
      "location": "new york",
      "short_description": "fafad",
      "long_description": "dasfgdgd",
      "id": 8
    },
    {
      "image": "/testdog.png",
      "breed": "Golden retreiver",
      "gender": "male",
      "location": "new york",
      "short_description": "dasdd",
      "long_description": "sad",
      "id": 9
    },
    {
      "image": "/testdog.png",
      "breed": "Golden retreiver",
      "gender": "male",
      "location": "new yorkd",
      "short_description": "ssd",
      "long_description": "dsgfa",
      "id": 10
    },
    {
      "category": "cat",
      "image": "/testdog.png",
      "breed": "Golden retreiver",
      "gender": "male",
      "location": "new yorks",
      "short_description": "csaca",
      "long_description": "csdsdf",
      "id": 11
    },
    {
      "category": "cat",
      "image": "/testdog.png",
      "breed": "Golden retreiver",
      "gender": "male",
      "location": "new york",
      "short_description": "ccs",
      "long_description": "cssc",
      "id": 12
    },
    {
      "category": "bird",
      "image": "/testdog.png",
      "breed": "Golden retreiver",
      "gender": "male",
      "location": "new york",
      "short_description": "csac",
      "long_description": "csafdsg",
      "id": 13
    }
  ]
}